{
  "format": "layers-model",
  "generatedBy": "keras v2.3.0-tf",
  "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
  "modelTopology": {
    "keras_version": "2.3.0-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_2",
        "layers": [
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_8",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              "batch_input_shape": [
                null,
                15,
                70,
                300
              ]
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_9",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    1
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              }
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "name": "time_distributed_10",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten_2",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              }
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_2",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 20,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [
          null,
          15,
          70,
          300
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_4/kernel",
          "shape": [
            20,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/kernel",
          "shape": [
            10,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/lstm_cell_2/kernel",
          "shape": [
            2144,
            80
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/lstm_cell_2/recurrent_kernel",
          "shape": [
            20,
            80
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/lstm_cell_2/bias",
          "shape": [
            80
          ],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_8/kernel",
          "shape": [
            3,
            300,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "time_distributed_8/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
