{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "signature": {"inputs": {"inputs:0": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization_1/batchnorm/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization/batchnorm/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/Equal/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/BiasAdd_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "30522"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30522"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_3/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_3/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization_1/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/layer_normalization_1/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/global_average_pooling1d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/outputs/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/outputs/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/Equal", "op": "Equal", "input": ["inputs", "StatefulPartitionedCall/transformer/padding_mask/Equal/y"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/embedding/Cast", "op": "Cast", "input": ["inputs"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/transformer/padding_mask/Equal"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/transformer/encoder/embedding/Cast", "StatefulPartitionedCall/transformer/encoder/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/padding_mask/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/transformer/padding_mask/Cast", "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack", "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack_1", "StatefulPartitionedCall/transformer/padding_mask/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "6"}, "end_mask": {"i": "9"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "9"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/tf.math.multiply/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/transformer/encoder/embedding/embedding_lookup", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/mul", "op": "Mul", "input": ["StatefulPartitionedCall/transformer/padding_mask/strided_slice", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/transformer/encoder/tf.math.multiply/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/Shape", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack_1", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1/0", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1", "op": "StridedSlice", "input": ["unknown_1", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_1", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/positional_encoding/add", "op": "AddV2", "input": ["StatefulPartitionedCall/transformer/encoder/tf.math.multiply/Mul", "StatefulPartitionedCall/transformer/encoder/positional_encoding/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/axes", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/free", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/axes", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/free", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/axes", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/free", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Shape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack_1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Const_2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2_1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Const_2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2_1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/GatherV2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Const_2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_1/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/2", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_2/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_3/shape", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/strided_slice", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_3/shape/1", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/Reshape_3/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Prod", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Prod", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Prod", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_1/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/transformer/encoder/positional_encoding/add", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot_2/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/Reshape", "StatefulPartitionedCall/transformer/encoder/encoder_layer_0/multihead_self_attention/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": 